// Задача 10: Напишите программу, которая на вход принимает трехзначное число,
// и на выходе показывает вторую цифру этого числа.

int num = int.Parse(Console.ReadLine());
int result = (num / 10) % 10;
Console.WriteLine(result);


www
